Tekla Open API Reference for Tekla Structures 2025
DrawingEnumeratorBase.AutoFetch Property
 Indicates that the objects are fetched from the drawing when the enumerator is created. Object information is therefore not anymore fetched when 'Current' item is asked from the enumerator. Property value is used for all enumerators in application
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool AutoFetch { get; set; }
Public Shared Property AutoFetch As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DrawingEnumeratorBase Class
Tekla.Structures.Drawing Namespace